net.bpelunit.framework.coverage/src/main/resources/MarkerService.wsdl

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<wsdl:definitions xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://www.bpelunit.net/services/marker" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" name="MarkerService" targetNamespace="http://www.bpelunit.net/services/marker">
  <wsdl:types>
    <wsdl:schema>
    	<wsdl:import namespace="http://www.bpelunit.net/services/marker" schemaLocation="MarkerService.xsd" />
    </wsdl:schema>
  </wsdl:types>
  <wsdl:message name="markRequest">
    <wsdl:part element="tns:mark" name="parameters"/>
  </wsdl:message>
  <wsdl:portType name="MarkerService">
    <wsdl:operation name="mark">
      <wsdl:input message="tns:markRequest"/>    </wsdl:operation>
  </wsdl:portType>
  <wsdl:binding name="MarkerServiceSOAP" type="tns:MarkerService">
    <soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
    <wsdl:operation name="mark">
      <soap:operation soapAction="http://www.example.org/MarkerService/mark"/>
      <wsdl:input>
        <soap:body use="literal"/>
      </wsdl:input>
      <wsdl:output>
        <soap:body use="literal"/>
      </wsdl:output>
    </wsdl:operation>
  </wsdl:binding>
  <wsdl:service name="MarkerService">
    <wsdl:port binding="tns:MarkerServiceSOAP" name="MarkerServiceSOAP">
      <soap:address location="http://www.example.org/"/>
    </wsdl:port>
  </wsdl:service>
</wsdl:definitions>
